# StructuralSectionShape Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSection..::..StructuralSectionShape Property
StructuralSection Class See Also
---
The type of structural section shape.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public StructuralSectionShape StructuralSectionShape { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StructuralSectionShape As StructuralSectionShape
	Get
```

Visual C++
---
```text
public:
property StructuralSectionShape StructuralSectionShape {
	StructuralSectionShape get ();
}
```

# See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace